[
    {
        "last_name": "ARMSTRONG",
        "first_name": "SHANNON",
        "avatar": "/images/avatars/shannon.armstrong@populationhp.com.png",
        "title": "VICE PRESIDENT, VALUE & ACCESS",
        "email": "shannon.armstrong@populationhp.com",
        "phone": "+1 857.523.0557",
        "experience": "On the board of an organization that supports adults with intellectual disabilities and committed to ensuring they live independent and fulfilling lives.",
        "personal": ["Two children, Cormac (20 years) and Desmond (16 years), who know everything about everything.", "1 rescue dog, Rebel (4 years) who will only beg for imported cheese and doesn’t waste her time on that American junk."],
        "interests": ["Running", "Biking", "Stand-up paddleboarding", "Reading", "Painting", "Gardening", "Word puzzles"],
        "bio": [
            "Based in Boston, I’m passionate about improving the efficiency of our healthcare system in order to get better outcomes for more people. I came to this non-linearly, from a bacheleor’s degree in Marketing & Communications from the University of Pennsylvania. From there, I started my career in the technology sector doing things like leading digital transformation in the print industry and white hat computer hacking. I discovered health economics when a friend, who worked in healthcare, asked for some help building an Excel model. I loved wrestling with massive amounts of disparate data and taming it into a cohesive and logical answer. Following that, I pursued a Masters of Science in Public Health/Health Economics at the London School of Hygiene and Tropical Medicine and spent a decade consulting in Market Access and evidence generation strategy for life sciences companies. I published a number of papers during this time and my favorite was looking at the time to ROI from different treatment options in stroke prevention. I left consulting to join the Medicines Company in a value & access role in 2015.  Following some time at Novartis and some freelance consulting, I joined Population Health Partners in 2022. "
        ],
        "type": "Metsera"
    },
    {
        "last_name": "BARKER",
        "first_name": "SUSAN",
        "avatar": "/images/avatars/susan.barker@metsera.com.png",
        "title": "DIRECTOR ADMINISTRATION",
        "email": "susan.barker@metsera.com",
        "phone": "+1 917.658.7139",
        "bio": [
            "I am a Director in Administration at Population Health Partners. I joined the company in early 2021 to implement efficiencies and liaise internally and externally to maximize team productivity. I am experienced in supporting and promoting organizations and high-profile individuals with strategies and logistics requiring complex coordination.",
            "Prior to my current role, I was Principal at Onrush Management & Media Group where I spearheaded public relations and marketing campaigns to raise clients' profiles including my work as Project Manager at Lincoln Center for the Performing Arts in launching Lincoln Center Stage on eleven cruise ships for Holland America Line. As Special Assistant to the Managing Partner of Seyfarth Shaw, I created platforms to streamline communications and increase practice productivity.",
            "As the co-owner of Kirshbaum Demler &  Associates, Inc., then one of the world’s most respected artist representation and public relations agencies for classical music, I promoted, garnished, and protected the reputations of world renowned performers, planned complex concert schedules worldwide, and oversaw financial matters.",
            "I have a masters in vocal performance from The Eastman School. I have been a guest lecturer for Chamber Music America, The Eastman School, Indiana University, Carnegie Hall, and a Professor at the Institute for Media and Entertainment, managed by IESE Business School."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "BERGGREN",
        "first_name": "ROY",
        "avatar": "/images/avatars/roy.berggren@populationhp.com.png",
        "title": "PARTNER",
        "email": "roy.berggren@populationhp.com",
        "phone": "+1 917.679.9470",
        "experience": ["Personal investing in medical devices, healthcare services, and health tech (angel, seed, series A) working informally with a gang of ex-McKinsey folks.", "Three decades consulting career with McKinsey in life sciences and healthcare services."],
        "personal": ["Married to Connie", "Live in New York City and on Long Island", "Pets – dog, cats, birds"],
        "interests": ["Animal welfare – working with several shelter organizations and animal sanctuaries", "Soccer – grew up playing, still play (carefully), and watch all the major European leagues", "Real estate/property investing ", "Fitness – variety of activities"],
        "bio": [
            "I am part of the broader PHP team, and my role with Metsera is probably just “to try to be helpful” – mainly related to various aspects of strategy work that goes on with respect to our portfolio, understanding our competitive landscape, and developing our ideas for how we could bring our medicines to patients.",
            "Born and raised in Sweden, I graduated from medical school but quickly shifted direction to business. Via an MBA at Columbia, I joined McKinsey & Company, moved to New York, and spent more than 3 decades with the firm. I was mainly focused on life sciences clients.  I worked with several companies in the biopharma industry in all major geographies on most of their important business issues, and for many years was a “top 10 traveler” at McKinsey. I had many leadership roles within the firm, but they were never that important to me. I mainly cared about serving clients.",
            "What excites me most about Metsera is the opportunity to play a role in helping this market scale in a way which “bends the curve” for obesity and its related co-morbidities. This category of medicines does not fully deserve its anticipated success unless that happens. Of course, many things have to come together to make that happen."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "BERNARD",
        "first_name": "WHIT",
        "avatar": "/images/avatars/whit.bernard@metsera.com.png",
        "title": "PARTNER AT PHP, COMMUNICATIONS",
        "email": "whit.bernard@metsera.com",
        "phone": "+1 646.322.3706",
        "experience": "I lost 30 pounds on Mounjaro, and am happy to share my experiences – both in using the drug and in running traps to try to access it. Additionally, along with a few other PHP colleagues, I helped set up a population-scale access deal with the UK Government for Leqvio®, designed to reach 300,000 adults within three years of launch. While the deal was not perfectly implemented, it established an important new framework for working in partnership with health systems to scale new technologies on day one, rather than waiting until genericization to realize their full impact.",
        "personal": ["I live in Brooklyn with my wife, Freya Zaheer, and our three young kids – Cyrus (age 6), Raza (age 3) and Kaiyan (age 0.5). Freya ran a vegan meal delivery company for eight years and has a lot to say about diet, health, and weight loss. "],
        "interests": ["Music remains a passion – especially classical music and jazz – and I play piano when I get the chance (which is sadly not often!)"],
        "bio": [
            "I am a co-founder and managing partner of Population Health Partners and Chief Operating Officer at Metsera, where I lead the Competitive Program, which includes the development pipeline, supporting capabilities, and go-to-market strategy.",
            "Prior to Metsera, I co-founded Areteia Therapeutics, a PHP portfolio company focused on advancing the first-ever oral therapy for eosinophilic asthma. I am an observer on Areteia’s Board of Directors on PHP’s behalf.",
            "Before joining PHP, I led Commercial Strategy and Business Development at The Medicines Company (MDCO), where I had responsibility for corporate strategy and go-to-market planning. I also oversaw a global business development process which resulted in the sale of the company for $9.7 billion in January 2020. Subsequent to the closing of that transaction, I co-led the integration of MDCO into Novartis.",
            "Prior to my role at The Medicines Company, I was an Associate Partner at McKinsey & Company, where I co-led a strategic service line for small cap clinical-stage biotechs, advised major pharmaceutical companies on innovative commercial models, and supported the creation of several private equity-sponsored strategies in the life sciences.",
            "Earlier in my career, I studied musicology as a Fulbright Scholar and helped launch a leading contemporary music nonprofit. I have an MBA with Honors from the Kellogg School of Management, and a BA summa cum laude in music from Brown University."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "BERRY",
        "first_name": "TAMSIN",
        "avatar": "/images/avatars/tamsin.berry@populationhp.com.png",
        "title": "PARTNER AT PHP, COMMUNICATIONS",
        "email": "tamsin.berry@populationhp.com",
        "phone": "+44 77.7901.0731",
        "personal": ["I live in London with my partner and three children."],
        "interests": ["Politics", "Snowboarding", "Travel", "Having fun"],
        "bio": [
            "I am a co-founder and partner of Population Health Partners. I have extensive experience in government and expertise in health policy.",
            "As the former Director of the UK Office for Life Sciences, I worked on the UK’s Life Sciences Industrial Strategy, which led to £3 billion of investment into UK biotech across several public and private partnership projects. I have held a number of leadership positions in government, spanning policy, corporate, and communications roles at the Cabinet Office, Department of Health, and Public Health England.",
            "My final role was in the COVID Taskforce, where I was the senior responsible officer for serology and seroprevalence surveys at the start of the pandemic and was awarded an OBE for my work. I studied law at Nottingham University, hold a Masters in Philosophy from the University of Leeds, and was a Science and Policy Fellow at University of Cambridge CSAP."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "BLOOM",
        "first_name": "STEPHEN",
        "avatar": "/images/avatars/stephen.bloom@metsera.com.png",
        "title": "SVP, R&D METSERA",
        "email": "stephen.bloom@metsera.com",
        "phone": "+44 20.7459.4142",
        "experience": "I was knighted in the Queen's 2012 New Year Honours and awarded Fellowships of the Royal College of Physicians (FRCP), Royal College of Pathologists (FRCPath), the Academy of Medical Sciences (FMedSci) and the Royal Society of Biology.  I was elected a fellow of the Royal Society in 2013, chairing the medical Sectional Committee 10 in 2021 and 2022. ",
        "personal": ["Married to Professor, Lady Margaret Bloom CBE", "Father of 4 children, Sarah, Nick, Chloe and James", "Grandpa to 11 grandchildren!"],
        "interests": ["Teaching science to my Grandchildren and beating them at chess.", "Walking"],
        "bio": [
            "I was educated at Cambridge University, where I was awarded a Master of Arts degree in 1968 and a Doctor of Medicine degree in 1979. I received my Doctor of Science (DSc) degree from the University of London in 1982. I completed medical training at Middlesex Hospital, University College London. I moved to the Royal Postgraduate Medical School at Hammersmith Hospital in 1974 as a Consultant Physician, and later Professor of Medicine and Chairman of the Academic Board. In Hammersmith Hospital, I was Director of Endocrinology and later also Director of Pathology.",
            "I am currently the Head of Drug Development, MDR, at Imperial College. In the 1980s we pioneered the discovery of several gut hormones and established their endocrine physiology, including their influence on appetite regulation and their simultaneous role as neurotransmitters. My research work over the years falls into five related categories: endocrinology clinical research, physiology and pathology of gut hormones, control of insulin release and insulin resistance, role of neuropeptides in organ control, and the role of neuropeptides in CNS regulation of appetite and related hypothalamic functions. During my 52 years at Imperial College, I have led a 30 strong research team. I have published over 1000 original papers and my h-index is 157, the 64th highest cited academic in the world of all time.",
            "I have been a member of the Main Scientific Board for AstraZeneca and advisory boards for Upjohn and Novartis. I was Senior Censor then Vice President of the Royal College of Physicians, Chairman of the Medical Research Society, Chairman of the Society for Endocrinology, Chairman of BioScientifica and Chairman of the Diabetes UK Research Committee as well as a past member of a number of MRC grant committees. I was a Board member of the National Institute of Biological Standards and Control (NIBSC) and Chairman of the Scientific Committee. I was a member of the Rector's weekly executive committee at Imperial College London and a member of the West London NHS Area Health Authority. I chaired the Warwick Medical School Faculty Advisory Board and the Health Partnership Board. I continue to sit on the Nestle Scientific Advisory Board. In 2018 I received an Honorary Doctorate of Warwick University and in 2019 an Honorary Doctorate of Brunel University. I was the Founder and Scientific Director of the biotech company Thiakis, which was sold for $150 million to Pfizer in 2008. In 2015 I was the founder and chairman of Zihipp, a company developing gut hormones to treat obesity. Zihipp was acquired by PHP in 2023. "
        ],
        "type": "Metsera"
    },
    {
        "last_name": "CLEGG",
        "first_name": "GRETCHEN",
        "avatar": "/images/avatars/gretchen.clegg@populationhp.com.png",
        "title": "VP,DATA MANAGEMENT LEADER",
        "email": "gretchen.clegg@populationhp.com",
        "phone": "+1 908.625.8604",
        "experience": "I am a Certified EDC Database Designer in Zelta.",
        "personal": ["Based in New Jersey"],
        "interests": ["Reading", "Skiing", "Strength Training"],
        "bio": [
            "I am a Clinical Data Management Leader with 17+ years of Clinical Data Management experience in all phases of the drug development process.  I started my career in Data Management at The Medicines Company in 2007 managing EDC (Electronic Data Capture) user accounts.  ",
            "As my experience in Data Management grew, so did my passion for developing eCRFs and “home grown” data review systems that would achieve efficient clinical trial delivery.  I am empowered to develop and execute strategies to generate valid evidence in support of life-science innovation using approaches that increase efficiencies by reducing time and cost. "
        ],
        "type": "Metsera"
    },
    {
        "last_name": "COMTOIS",
        "first_name": "SPENCER",
        "avatar": "/images/avatars/spencer@clinplan.com.png",
        "title": "DRUG SUPPLY CONSULTANT",
        "email": "spencer@clinplan.com",
        "phone": "+1 908.251.7265",
        "personal": ["Married with 2 kids and one on the way!"],
        "interests": ["Fishing and Sports"],
        "bio": [
            "I am a Clincial Supply Chain consultant with over 20 years of direct industry experience in Europe and the US. I was formerly with the Medicines company/Novartis, I also support the Areteia Phase 3 program for all drug supply related activities.  "
        ],
        "type": "Metsera"
    },
    {
        "last_name": "COOKE",
        "first_name": "DUNSTAN",
        "avatar": "/images/avatars/dunstan.cooke@metsera.com.png",
        "title": "VICE PRESIDENT CORPORATE OPERATIONS",
        "email": "dunstan.cooke@metsera.com",
        "phone": "+44 79.6854.2808",
        "experience": "Corporate (fundraising, trade sale/exits), IP (patent prosecution, FTO, trademarks, and trade secrets), business development (licensing, partnerships, strategic alliances), and company operations (finance, tax, IT).",
        "personal": ["Married with one son", "Based in Germany (Freiburg) and the UK (London)"],
        "interests": ["Being outdoors: open water swimming, skiing, and walking", "Travel", "Cricket (watching, not playing…)"],
        "bio": [
            "I have a BSc in Biochemistry, a MPhil in Molecular & Cellular Biology (Birmingham), and a PhD in Biochemical Engineering (University College London), with an enterprise scholarship from the London Business School, and I am an Associate Fellow of IChemE. I have 20 years of experience running start-ups with a focus on corporate/business development activities, including Thiakis (sold to Wyeth/Pfizer)."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "CZEPIEL",
        "first_name": "TINA S",
        "avatar": "/images/avatars/tina.czepiel@populationhp.com.png",
        "title": "VICE PRESIDENT, LEGAL",
        "email": "tina.czepiel@populationhp.com",
        "phone": "+1 908.400.2969",
        "personal": ["Two Children (Rachel is a 27-year-old social worker for Comassus Hospice in Lancaster County, Pennsylvania and Evan is a 23-year-old teacher in the Easton, Pennsylvania school system", "I have two miniature golden doodles who will be 2 years old on March 1 – their names are Roscoe and Winnie."],
        "interests": ["Singing", "Beaching", "Traveling", "Pilates", "Yoga"],
        "bio": [
            "I was born in Englewood, New Jersey and spent most of my life in New Jersey.  My primary residence is now Nokomis, Florida and I also have a home in Ephrata, Pennsylvania where I spend time on the holidays with my children and birthdays. I have been in Florida for a few years, but I will always be a New Jersey girl at heart. I matriculated from Skidmore College with a degree in vocal performance and biochemistry, and I matriculated from Albany Law School of Union University.  I have spent most of my career in the pharmaceutical/biotech space.  I started my career in pharma as a clinical research associate, and then moved into a project manager role, and finally into roles involving contract and informed consent negotiation.  I have also held roles in various levels of management for departments that perform contract and informed consent form negotiation as well as collection of regulatory documentation. "
        ],
        "type": "Metsera"
    },
    {
        "last_name": "DENWOOD",
        "first_name": "TOM",
        "avatar": "/images/avatars/tom.denwood@metsera.com.png",
        "title": "CHIEF DIGITAL OFFICER",
        "email": "tom.denwood@metsera.com",
        "phone": "+44 79.0998.2295",
        "experience": "Bringing the art/science of major program management, and internal join-up, to enable successful delivery of Metsera Programs",
        "personal": ["Father of four children", "Cycling mad household!", "Want to improve global health"],
        "interests": ["Cycling", "Reading (esp FT Weekend)", "Viticulture", "Good government/politics", "Climate change"],
        "bio": [
            "As Chief Digital Officer at Population Health Partners, and interim CDO at Metsera, I am passionate about transforming health outcomes for populations. ",
            "I have worked for over 20 years in senior roles in health and care technology. I previously spent 17 years in the NHS in England, UK, culminating in being Executive Director of Data, Insights and Statistics at NHS Digital where I led the curation, collection, and appropriate use of England’s health data (56m population) including co-establishing NHS DigiTrials that was instrumental to the COVID RECOVERY Trial, and leading digital delivery of the UK COVID vaccine volunteer registry. I was also Senior Responsible Owner for the full lifecycle of the new data network for the NHS: Health and Social Care Network (from £780m / 5 year) from outline business case approval through to procurement strategy and execution, full migration and recurring £75m annualized saving delivered. Prior to that, I led programs of work supporting procurement and digitisation of NHS Trusts through Electronic Patient Record (EPR) delivery.",
            "I previously worked on the London 2012 Olympics Venue Security, and Mayor of London’s Congestion Charging Scheme in delivery roles.",
            "I have an MSc in Major Programme Management (Oxford), BSc Biological Sciences (Birmingham) and is a graduate of the HM Government Major Programme Leadership Academy. I am a Fellow of the British Computer Society, and Royal Society of Medicine. I am PRINCE 2 and a Managing Successful Programs practitioner and have an Advanced Diploma in Management Accounting."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "DONOVAN",
        "first_name": "MICHAEL",
        "avatar": "/images/avatars/michael.donovan@metsera.com.png",
        "title": "CHIEF DESIGN OFFICER",
        "email": "michael.donovan@metsera.com",
        "phone": "+1 917.273.6182",
        "experience": "I am an enthusiastic visitor to farmers markets and understand the benefits of farm-to-table cooking.",
        "personal": ["Father of two daughters", "Lived in New York 40+ years", "Avid fly fisherman"],
        "interests": ["Reading", "Writing", "Cooking", "Exercise / Swimming", "Travel", "Gardening"],
        "bio": [
            "I am a former founding partner of Donovan/Green, which focused on creating and innovating for an extensive roster of marque clients. As an incessant learner, active, creative entrepreneur.",
            "I have served on the Municipal Arts Society Board of Governors, and I am currently on the Parsons School of Design Board of Governors where I have served as Vice-Chairman. In addition, I have served on the national boards of the American Institute of Graphic Arts, The Society of Environmental Graphic Design, The National Design Center, The Art Directors Club and as an advisor to the Aspen Design Conference. Throughout my creative career I have received recognition and awards for branding solutions, information design, and environmental design, and was recognized in Richard Saul Wurman’s 1000 Most Creative People in America. I am an NEA Fellow and received the Christian Petersen Award for Creativity from Iowa State University, my first alma mater, where I serve as an advisor to the Design College. I have taught at Parsons School of Design and Pratt Institute, and I hold degrees from Iowa State University and Parsons School of Design. I was presented with the prestigious Distinguished Service Award by Parsons School of Design / New School University.",
            "In 2014, both Nancye Green and I were awarded the American Institute of Graphic Arts Medal — the most distinguished in the field—in recognition of our exceptional achievements, services or other contributions to the field of design and visual communication.",
            "In addition to my many accolades, I am also, proudly, an Eagle Scout. My small-town Midwest boyhood – and love of writing – has led me to create a series of soon-to-be published essays about those years."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "ELKIN",
        "first_name": "STEVE",
        "avatar": "/images/avatars/steve.elkin@populationhp.com.png",
        "title": "SENIOR DIRECTOR OF PROGRAMMING",
        "email": "steve.elkin@populationhp.com",
        "phone": "+1 908.451.1377",
        "personal": ["MS Degree in Statistics, SUNY Stony Brook, 1990", "BS Ceramic Engineering, Alfred University, 1986", "Passionate leader and mentor of Statistical Programmers", "Focused on how to best get things done", "Married with 2 adult children"],
        "interests": ["Running", "NY Sports teams", "TV binging"],
        "bio": [
            "I have 30 years of pharmaceutical industry experience working in the statistical programming and biostatistics function focusing on clinical trial data standardization and analysis.  I have successfully built and led programming teams to generate high quality deliverables efficiently meeting business and regulatory needs.  Combining my SAS software expertise with a deep understanding of statistical analysis and data submission standards (i.e., SDTM, ADaM), I successfully delivered analyses supporting many CSRs, publications, regulatory filings and FDA responses; and served on advisory board meeting Q&A response teams.  My therapeutic area experience includes cardiovascular and metabolic disease, immunology and virology, oncology, and CNS.  My prior company experience includes large pharma such as Pfizer, Novartis and Roche, small pharma including The Medicines Company, and recent CRO experience with ClinChoice."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "EVANS",
        "first_name": "DENISE",
        "avatar": "/images/avatars/denise.evans@populationhp.com.png",
        "title": "CONSULTANT DATA MANAGEMENT",
        "email": "denise.evans@populationhp.com",
        "phone": "+1 512.230.3128",
        "experience": "I have experience and understanding within multiple therapeutic areas including acute care medicine specifically related to cardiovascular, cardio-pulmonary, hematology, lipid disorders, osteoarthritis, and pediatrics. I have a MSHS with a Concentration in Clinical Research from The George Washington University and a BS in Biology from Susquehanna University. ",
        "personal": ["Based in Austin, TX"],
        "interests": ["Health and Fitness", "Skiing (downhill and cross-country)", "Running", "Exploring “van life”", "Volunteering "],
        "bio": [
            "I have over 27 years of pharmaceutical/biotech/CRO experience with knowledge and expertise in a variety of cross-functional roles within operations and data management. I started my career as a CRA working primarily on in-patient studies of rare diseases, eventually branching out to more generalized cardiovascular diseases and outpatient trials.  I eventually joined The Medicines Company where I spent 14 years gaining experience in a wide variety of clinical operations and eventually data management roles. During this tenure at The Medicines Company, I was one of the first Clinical Operations Leads (COL) and eventually went on to manage the entire COL team for the organization.  As the years progressed, I transitioned from the COL role on to Project Manager, Program Manager, and eventually became the Head of Data Management. In addition to these roles, I have also supported Medical Affairs, Medical Writing and SOP development activities within The Medicines Company and other organizations. Over the past two years, I have focused on enhancing my medical writing capabilities, recently acquiring a certification from the University of Chicago in Medical Writing and Copyediting. "
        ],
        "type": "Metsera"
    },
    {
        "last_name": "FRIEDMAN",
        "first_name": "ANDREW",
        "avatar": "/images/avatars/andrew.friedman@populationhp.com.png",
        "title": "EXECUTIVE VP, HEAD OF REGULATORY AND DEVELOPMENT STRATEGY",
        "email": "andrew.friedman@populationhp.com",
        "phone": "+1 609.955.0467",
        "bio": [
            "I am the Executive Vice President and Head of Global Regulatory and Development Strategy for Validae Health. I am responsible for setting the global regulatory and development strategy and driving execution of the development and regulatory plans for the assets under the Validae Health portfolio. ",
            "I am a member of the senior leadership team for the dexpramipexole program at Areteia Therapeutics.   I joined Validae Health in April 2021. Prior to joining Validae Health, I was the Senior Vice President and Head of Global Regulatory Affairs at The Medicines Company. At The Medicines Company, I successfully led and implemented the regulatory strategy for the Inclisiran Program, from filing the initial IND to the eventual NDA/MAA. During my tenure at The Medicines Company, I was responsible for the programs across the portfolio and for multiple successful filings and approvals.",
            "Prior to my time at The Medicines Company, I spent several years as the Therapeutic Area Head in various TA's within Regulatory at Hoffman LaRoche and then Bristol Myers Squibb. I started my career in the pharmaceutical industry over 25 years ago at Merck & Co in Clinical Research and then transitioned into Regulatory Affairs.",
            "I earned my PharmD summa cum laude from Shenandoah University and a BS in Pharmacy, cum laude, from Long Island University. I also hold a Bachelor of Arts in Communications from Brooklyn College."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "GREEN",
        "first_name": "NANCYE",
        "avatar": "/images/avatars/nancye.green@metsera.com.png",
        "title": "CHIEF EXPERIENCE OFFICER",
        "email": "nancye.green@metsera.com",
        "phone": "+1 917.273.3536",
        "experience": "Coached authors writing books/art directed book design",
        "personal": ["Grew up traveling around the world", "Settled in NYC after college and never left", "Raised two daughters in NYC", "Love dogs"],
        "interests": ["Reading/Audiobooks", "Theater/Ballet"],
        "bio": [
            "I am a designer and have spent my career addressing the purpose, strategies, and complex communication challenges of enterprises – large and small, established and start-up, public, private, and non-profit. Michael Donovan and I founded Donovan/Green, which grew to over 100 people before we sold it in 1995. From our earliest days, we helped shape the ideas around experience design, identifying empathy as a critical design competency, and were identified as one of the leading proponents of ‘information design’, which places value on simplification and effective, clear, and informative ways of portraying complex subjects. We designed and produced new programs, products, and strategies for a breadth of enterprises across industries – Hoffman-La Roche, Amgen, Intercept, 3M, GM, P&G, Exxon, American Express, Sony, Disney, and American Girl, to name a few. After selling our firm, I served as CEO of Waterworks, a director of several companies including Waterworks and Hallmark, a founding member of the Design Advisory Board of P&G. I was Chief Design Officer at The Medicines Company for 6 years. As the first woman president of both the American Institute of Graphic Arts and the International Design Conference in Aspen, I have been fortunate to have positions where I have been able to promote design and designers as critical to the success of any enterprise driven by purpose and striving for clarity, simplicity, and understanding.  Most recently, I was Chair of the Board of Directors of EcoHealth Alliance and am on the Board of Trustees of The New School. I hold degrees from Tulane University with honors in Political Science, and Parsons School of Design, where I graduated as valedictorian magna cum laude in Environmental Design. I was awarded the AIGA medal for lifetime achievement and an honorary doctorate from The Corcoran School of Art in Washington, D.C. Michael Donovan and I live in Chelsea in NYC, where we relish our urban lives. "
        ],
        "type": "Metsera"
    },
    {
        "last_name": "HINDS",
        "first_name": "CHARLOTTE",
        "avatar": "/images/avatars/charlotte.hinds@metsera.com.png",
        "title": "SENIOR DIRECTOR R&D",
        "email": "charlotte.hinds@metsera.com",
        "phone": "+44 20.7459.4142",
        "experience": "Adjacent to my interests in the treatment of metabolic disease, I am fascinated by the existence of Blue Zones. I enjoy reading around the fields of longevity and healthspan, and am a strong advocate for plant-forward diets and the need for food system reform. ",
        "personal": ["Born and raised in the Cayman Islands ", "Aunt to one adorable niece ", "Aspirant dog owner"],
        "interests": ["Environmental sustainability", "London’s multi-cultured food scene ", "Basking in sunshine", "Engaging in community service "],
        "bio": [
            "My career has focused on the development and realization of novel multi-hormone therapeutics for obesity and type 2 diabetes. I have a special interest in drug discovery and in-vivo study design, having learned the tricks of the trade under the tutelage of Sir Prof. Steve Bloom during my PhD studentship at Imperial College London from 2019-2022. Prior to this, I pursued undergraduate studies at University College London, where I obtained a BSc. in Neuroscience. In 2023, I joined Zihipp as the Principal Scientist, where I leveraged my expertise in translational research to advance the preclinical characterization of promising drug candidates. I have been privileged enough to steer the progress of several compounds from discovery through to clinic, and my work has contributed to advancements in the field of GLP-1 receptor pharmacology.",
            "In 2023, I was honored by Cayman Connection to be the recipient of the Making Waves B1 STEM Award, which recognizes Caymanian’s abroad who have made outstanding contributions to their field. "
        ],
        "type": "Metsera"
    },
    {
        "last_name": "HOEY",
        "first_name": "DAN",
        "avatar": "/images/avatars/dan.hoey@metsera.com.png",
        "title": "CHIEF TECHNICAL OPERATIONS OFFICER",
        "email": "dan.hoey@metsera.com",
        "phone": "+1 850.687.0089",
        "personal": ["Married to Ashley", "Grew up in Michigan, lived in New Jersey, Georgia and Ireland", "Currently live in Northwest Florida", "3 dogs (Abbey, Emmy and Georgia) and cat (Olive)"],
        "interests": ["Golf", "Live Music", "Fun in the Sun (Beach, Bike, Paddle Board, Boating)"],
        "bio": [
            "I am an industry leader in pharmaceutical product development, manufacturing operations and supply chain management with over 34 years of experience in the industry. Prior to joining Metsera, I was the Chief Technical Operations and Quality officer for EQRx, a Cambridge based biotech start-up focused on bringing forward new molecular entities for the treatment of cancer and I&I diseases at radically lower prices.  Prior to EQRx, I led the global supply chain management function at Teva, where I led the operation and transformation of the largest and most broad global pharmaceutical supply chain. ",
            "Previously, I led manufacturing and supply chain operations for Teva API which consisted of 18 manufacturing plants around the world (in China, India, Israel, Eastern and Western Europe, Mexico and the US) producing small molecules, peptides and biologics to support the Teva pharmaceutical business and also an $800M per year revenue stream supplying APIs to 3rd party generic and contract customers.",
            "Prior to Teva, I spent 27 years with Merck and Co. Inc. leading multi-plant networks of manufacturing operations in Asia, Europe, and North and South America, new product development and launch operations, and strategy development and contract manufacturing. I am certified in application of lean manufacturing and six-sigma process improvement in pharmaceutical operations.",
            "I hold a Bachelor of Science in Chemical Engineering from Michigan State University. "
        ],
        "type": "Metsera"
    },
    {
        "last_name": "HUBBARD",
        "first_name": "BRIAN",
        "avatar": "/images/avatars/brian.hubbard@metsera.com.png",
        "title": "CHIEF SCIENTIFIC OFFICER",
        "email": "brian.hubbard@metsera.com",
        "phone": "+1 908.432.1362",
        "bio": [
            "I am Chief Scientific Officer at Metsera Therapeutics committed to addressing obesity and related metabolic diseases. My work focuses on creating innovative treatments aimed at improving the lives of those afflicted by these widespread conditions. With a Ph.D. in Chemistry from the University of Illinois and a postdoctoral fellowship at Harvard Medical School, my career has been marked by significant achievements in the biopharmaceutical industry. Over nearly three decades, my roles have spanned from research and development at leading companies to entrepreneurial ventures.  Many of these ventures have led to impactful collaborations, such as AstraZeneca and Dogma Therapeutics, with the goal of treating cardiovascular disease.",
            "At Metsera, my efforts are dedicated to developing therapies that offer more effective and personalized options for patients, reflecting my commitment to tackling some of the most common health challenges. This commitment extends beyond my professional life into personal passions, including coaching high school and youth football, where I dedicated my time and energy to the health and well-being of young athletes. My hobbies, such as skiing, hiking, and powerlifting, illustrate a balance between my professional endeavors and a personal commitment to physical activity and health.",
            "My career and personal interests demonstrate a unique blend of scientific rigor, leadership in healthcare innovation, and a genuine dedication to community service. Through my work at Metsera and beyond, I continue to contribute to the advancement of treatments for prevalent diseases, all while fostering a healthy, active lifestyle."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "HURD",
        "first_name": "SANDY",
        "avatar": "/images/avatars/sandy.hurd@metsera.com.png",
        "title": "CMC LEAD",
        "email": "sandy.hurd@metsera.com",
        "phone": "+1 269.873.0873",
        "personal": ["I met my wife, Lin, at Illinois and together we have 5 children ranging from 27 to 12. The 4 older ones are either in college or out of school and now spread out over the country (Eugene, OR; Boulder CO; Kalamazoo, MI; and Gainesville, FL). The youngest boy still lives with Mom and Dad in Bradenton, FL.", "I played hockey for many years and then coached youth and high school hockey in Michigan for over 20 years.  In 2020, I abruptly gave all that up and now I pretend to be a runner."],
        "interests": ["Camping", "Brewing beer", "Reading", "Sailing"],
        "bio": [
            "I grew up on Cape Cod and then spent many years in Ann Arbor, Michigan. I have recently moved to Florida, but prefer to escape to northern Michigan where my family has a cabin on a lake in the summer months.  Advanced degrees in organic chemisty took me to Colgate University, University of Illinois at Champaign-Urbana, and Harvard.  Professionally, I was a medicinal chemist at Pharmacia and then Pfizer before morphing into a process chemist and drug product developer at several biotech companies.  In that space I have worked on oral solid dosage and injectable products from preclinical to phase 3 and commercial readiness in the small molecule and peptide modalities."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "KAMPS",
        "first_name": "CHLOE",
        "avatar": "/images/avatars/chloe.kamps@metsera.com.png",
        "title": "SENIOR PROJECT MANAGER",
        "email": "chloe.kamps@metsera.com",
        "phone": "+1 727.804.8777",
        "personal": ["I have a puppy named Nymphadora who looks like a little fox. ", "I am very active in volunteering through Rotary and Junior League where I focus on causes related to environmentalism and children’s education and health. "],
        "interests": ["Golf", "Horseback Riding", "Rock Climbing", "Reading (particularly fantasy and folklore)", "Scuba diving ", "Skilled Bosun"],
        "bio": [
            "I was born and raised in Florida and currently resides in St. Petersburg, Florida, but previously lived briefly in Boston and then Berlin while I worked for Anji Pharma as the Translational Project Manager helping to move oncology programs into the clinic.  Before living in Berlin/Boston, I moved back from Shanghai in 2022 where I lived for almost 5 years. While there I worked at two biotech investment companies, Viva BioInnovator, and JMCR Partners.  At Viva, I led investment diligence, strategy development, and alliance management for 50+ portfolio companies and helped build the investment office from 2 employees to 20. At JMCR, I led marketing and investor relations. In previous roles, I worked in the Florida State Senate and the Institute for Nonprofit Innovation and Excellence where I focused on project management, industry review, and nonprofit advocacy.",
            "I received my M.A. in Asian Studies with a concentration in Economics and a B.S. in International Affairs and Economics from Florida State University. I also studied at Fudan University, Shanghai, and Koc University, Istanbul."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "KANE",
        "first_name": "MARIE",
        "avatar": "/images/avatars/marie.kane@populationhp.com.png",
        "title": "VP INNOVATIVE CLINICAL TRIAL SOLUTIONS",
        "email": "marie.kane@populationhp.com",
        "phone": "+44 78.8268.4991",
        "experience": "Formerly, I led development of enterprise web services for large public sector organisations. Led award winning digital marketing teams in UK Higher Education. Ten years working in the NHS including running change management programmes and as a Research Fellow researching and implementing strategies to improve patient safety. I still love a spreadsheet, though I have forgotten how to code. ",
        "personal": ["I have one son. ", "I live in Stockport, just outside Manchester, UK. "],
        "interests": ["Outdoor activities: tennis, walking, running.", "Looking after my dog", "Cooking for family and friends"],
        "bio": [
            "I am passionate about designing and running clinical trials that are efficient, which test the products on the citizens who will ultimately receive them when approved and designing an implementation to deliver those products where they provide the most benefit to the citizens, the healthcare system and our shareholders.",
            "I have experience in leading clinical trial execution, business development, investment, corporate scale up, innovation across business processes and technology, finance, contract negotiation and have an extensive network in life science and healthcare systems. "
        ],
        "type": "Metsera"
    },
    {
        "last_name": "KAUSHIK",
        "first_name": "VIRENDAR",
        "avatar": "/images/avatars/virendar.kaushik@metsera.com.png",
        "title": "VICE PRESIDENT, PROJECT LEADER",
        "email": "virendar.kaushik@metsera.com",
        "phone": "+1 617.413.5646",
        "experience": "I serve as an adjunct Associate Professor at the Tufts University Friedman School of Nutrition Science and Policy, lecturing on insulin resistance, type 2 diabetes, LDL cholesterol, and niacin metabolism.",
        "personal": ["Husband and father of one son and two daughters", "Grew up in Shelton CT, but have lived in Boston area for 30+ years despite being a proud New York Yankees fan"],
        "interests": ["Coaching youth sports", "Avid sports fan who will happily play any team sport", "Reading (spy mystery, biographies)", "Standup comedy (watching, not performing!)"],
        "bio": [
            "I am thrilled to be a part of the Metsera team that shares my passion to bring new medicines to patients suffering from metabolic disease. Prior to joining Metsera, I served as the Head of Research at Anji Pharmaceuticals where I was responsible for advancing an early stage metabolic disease and oncology portfolio into and through IND-enabling studies. Before Anji, at the Broad Institute I built and directed a therapeutics discovery organization that collaborated with faculty to build partnerships with industry and venture capital in order to bring transformative medicines to patients across a range of therapeutic areas.  Using biochemistry, biophysics, and structure-based drug design approaches, three programs entered clinical development.",
            "In 2015, I co-founded single asset companies Apolo1 Bio (chronic kidney disease) and Dogma Therapeutics (heart disease). Both were acquired and those discoveries are progressing through Phase III and Phase II clinical development, respectively. Additional previous experiences include leading and contributing to metabolic drug discovery programs that entered clinical development at both Novartis and Millennium Pharmaceuticals. ",
            "I received my B.A. in Biology and M.A. in Physiology from Boston University, and a Ph.D in Nutritional Biochemistry from Tufts University."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "KHANDAN-NIA",
        "first_name": "NIMA",
        "avatar": "/images/avatars/n.khandan-nia@populationhp.com.png",
        "title": "MR",
        "email": "n.khandan-nia@populationhp.com",
        "phone": "+44 20.7594.7994",
        "interests": ["Motorsport", "Astronomy", "Football", "Rugby"],
        "bio": [
            "I joined Imperial College after university as an Endocrine researcher. Over the years, I covered many roles that encompassed finance and management as well as researching higher education and the commercial sector. Now with over 30 years of financial, commercial and operational experience, I now combine clinical scientific know-how and financial business acumen. I am involved in investment fundraising in a range of sectors and financial management of c.£60M to date. I currently oversee key functional areas for the business, including, but not limited to, finance, laboratory setup and functionality, and contract negotiations. My other roles include Head of Operations at the Drug Discovery section within Imperial College London."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "LOPEZ",
        "first_name": "STUART",
        "avatar": "/images/avatars/stuart.lopez@populationhp.com.png",
        "title": "SENIOR DESIGNER",
        "email": "stuart.lopez@populationhp.com",
        "phone": "+1 609.424.4944",
        "experience": "I helped design the Metsera logo and designed/developed the Metsera portal you use today. Also, very good with developing—everyone’s favorite—PowerPoint presentations. ",
        "personal": ["Married since 2014", "Father to a daughter and two sons", "Lived in Roebling, NJ for 30+ years", "I’m a very patient and calm person"],
        "interests": ["Board Games ", "Fan of all Philadelphia Teams", "Phila Union Season Ticket Member", "Travel", "Disney", "Playing Tennis"],
        "bio": [
            "I launched my professional career at Jacob’s Pillow after graduating magna cum laude with a BFA in Graphic Design/Art History from Rowan University, where I was awarded the Parthenia J. Vandermark Creative Arts Award. After going through a competitive application process, I was selected as the sole design intern for the  summer festival at Jacob's Pillow, which is a National Historic Landmark in the Berkshires of Massachusetts. It was the beginning of becoming a jack-of-all trades designer.",
            "Right after that, I joined Donovan/Green in NYC where I commuted 4 hours daily, but I knew it was where I wanted to be. I’ve worked closely with Michael Donovan and Nancye Green for over 10 years on various types of projects from large marketing pieces such as billboards, commercials, and personalized marketing outreach, to everything in between, including branding companies for multiple start-ups. I love working with creative thinkers from all  industries and have developed an ability to brainstorm ways to simplify their messaging in an interesting and functional manner so that the result is understandable for the end user. ",
            "In April of 2023, I transitioned to work part-time with Population Health Partners.   The occasional  projects with AreteiaTheapeutics  allow for some diversity in work and  I’m excited for the opportunities that will surface from applying my skills in partnership with the team at Metsera. "
        ],
        "type": "Metsera"
    },
    {
        "last_name": "Lucas",
        "first_name": "Amanda",
        "avatar": "/images/avatars/amanda.lucas@populationhp.com.png",
        "title": "SENIOR DIRECTOR OF PARTNERSHIPS & DELIVERY",
        "email": "amanda.lucas@populationhp.com",
        "phone": "+44 74.1482.9021",
        "personal": ["Mum to two boys who are growing up fast.  After 20 years living in London, we recently moved the family to Kenilwoth in Warwickhsire, England and are enjoying settling into our new home."],
        "interests": ["Love to exercise with faves being running and yoga, good for body and mind."],
        "bio": [
            "I am an Entrepreneurial Director with over 20 years of experience working in the UK heath and care sector.  As a Director with Imperial College Health Partners, I established a leading multi-million-pound real world data business on behalf of the NHS delivering research services, with a track record of developing successful commercial and strategic partnerships across life sciences, NHS, and academia.  ",
            "Formerly I was a management consultant with KMPG with clients across health care and UK governant.  I am a delivery-focused and a strategic thinker who enjoys building strong relationships with stakeholders."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "LUCERIAGA",
        "first_name": "VENICE",
        "avatar": "/images/avatars/venice.luceriaga@populationhp.com.png",
        "title": "HS BUSINESS PARTNER & OPERATIONS",
        "email": "venice.luceriaga@populationhp.com",
        "phone": "+1 240.441.5579",
        "personal": ["I live in Alexandria, VA ", "My family is from the Philippines and I moved to the DC area when I was very young"],
        "interests": ["Keeping houseplants alive", "Watercolor painting", "DIY craft projects ", "Good weekend brunch spots"],
        "bio": [
            "I am a certified professional in Human Resources with experience supporting and collaborating with teams in various areas of HR operations, talent and acquisition, benefits admin, employee management and engagement. Prior to joining the company, I served as a Business Partner and Operations at GeneDx where I worked for 10 years. I was responsible for daily HR operations, developed and implemented policies, programs and various company initiatives. As an all-around HR professional, I worked closely with management, compliance, quality, finance and operations teams. ",
            "I have a BS in Biological Sciences from UMBC and my career in Human Resources started shortly after graduation. While searching for my first full time role, I worked part time for a recruiting firm supporting the biotech corridor in MD. I quickly developed an interest in employee relations, networking with managers and employees and shifted my career path to a full time role within that recruiting firm. Ultimately, I aim to make a positive impact, striving to enhance the employee experience and the organization’s people operations. "
        ],
        "type": "Metsera"
    },
    {
        "last_name": "MALVIYA",
        "first_name": "RESHMA",
        "avatar": "/images/avatars/reshma.malviya@metsera.com.png",
        "title": "Senior Clinical Trial Manager",
        "email": "reshma.malviya@metsera.com",
        "phone": "+44 79.5026.0737",
        "personal": ["Wife & mother of two children & the family dog", "Enjoys spending quality time with family & friends"],
        "interests": ["Globetrotting ", "Theatre devotee", "Enjoys sci-fi/comedy movies", "Gym, swimming, yoga", "Reading", "Spoiling my beloved dog Neo"],
        "bio": [
            "Prior to joining Metsera, I was part of Prof Steve Bloom’s drug development team at Imperial College London for over ten years. As well as assisting in pre-clinical & toxicology studies, I was responsible for the coordination and project management of five first-in human (FIH) Phase I clinical trials of gut hormone analogues. My role involved in every aspect of clinical trial management and administration from vendor selection, overseeing all operational & clinical trial activities, regulatory writing and submissions. ",
            "I began my career in the field of genetics, spending over fourteen years researching the causes of inherited retinal disease. Primarily based at the Institute of Ophthalmology (Moorfield’s Eye Hospital, University College London, UK) to complete my Ph.D. & postdoc, my work took me to University of Michigan (exploring novel cloning techniques) and to Childrens Hospital Los Angeles, University Southern California to develop gene therapy techniques. After spending time bringing up my two children during their early years, I volunteered at London’s Science Museum as a content developer and fundraiser for a year before embarking on my current career."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "MEANWELL",
        "first_name": "CLIVE",
        "avatar": "/images/avatars/clive.meanwell@metsera.com.png",
        "title": "CHIEF EXECUTIVE OFFICER",
        "email": "clive.meanwell@metsera.com",
        "phone": "+1 908.872.9607",
        "experience": "A long list of self-inflicted difficult situations and complex mistakes. I clocked millions of hours on Microsoft products such as PowerPoint and Word, yet am still notoriously unreliable on Excel without Chris Visioli checking the formulae. Don’t believe any of my financial estimates.",
        "personal": ["I talk too much. I drink a lot of tea with so much sugar that I produce more GLP-1 RA than Novo Nordisk on a monthly basis. I am trying (earnestly) to be woke. I am a Manchester United fan who remembers when they were very good."],
        "interests": ["Changing everything, everywhere, all at once, so everyone can flourish, all the time. Things do need to improve, don’t they? Who else is going to do it?"],
        "bio": [
            "I am a doctor (hard to believe but true) who trained in cancer treatment and did enough bench science to realize I was not any good at it. My most recent research project in collaboration with ‘23andMe’ says my genes come mostly from England and Ireland. ",
            "I had a longer-than-I-care-to-admit career in medicine, epidemiology, new product development, regulatory affairs, and marketing and general management or leadership. I had several concussions (which could explain much) during a short but   self-proclaimed glorious rugby career (British sports media were not always in agreement).  I was enslaved by the NHS for years, then escaped to the dark side and worked jobs I was not qualified for (and thereby learned things) at Roche, Amgen, and Genentech before co-founding the venture investor MPM Capital sometime in the last century. I have been a board member of BB Biotech, the Swiss investment corporation, for the last 19 years which is certainly too long. Back in 1996 I mortgaged my house, started, built and led The Medicines Company for the next 24 years before becoming an overnight success when I was fired by an activist and simultaneously bailed out by Whit Bernard, Chris Visioli and Peter Wijngaard who sold the company for $9.7 billion. Summarily rejected as a candidate for any job by Novartis, I (with trusted colleagues, Chris Cox, Whit Bernard and Tamsin Berry) founded Population Health Partners and then set about (with many more trusted colleagues) creating and building Metsera. I do not anticipate another 24-year gig, which is a comfort to many in the firm and its investors. "
        ],
        "type": "Metsera"
    },
    {
        "last_name": "MINNION",
        "first_name": "JAMES S.",
        "avatar": "/images/avatars/james.minnion@metsera.com.png",
        "title": "VICE PRESIDENT, R&D",
        "email": "james.minnion@metsera.com",
        "phone": "+44 77.1919.2505",
        "personal": ["Parent of two children, Hanna and Robert, who are still young enough to want to know me and keep me entertained rather than stressed.", "Live in Basingstoke Hampshire, 50 miles southwest of London."],
        "interests": ["Better defined as aspirations, I love to get into the mountains and lakes for hiking, cycling and kayaking.", "Helping where I see a need, and I have a skill or resource to make a difference."],
        "bio": [
            "Born in Carlisle, Cumbria, Northen England, I spent my formative years in a rural community. I completed my undergraduate degree at the University of Glasgow, studying molecular and cellular biology with an industrial placement year at GSK. I continued my studies at Imperial College London and completed my PhD under the supervision of Professor Sir Stephen Bloom. My PhD studies focused on developing a novel oxyntomodulin analogue. After finishing my studies, I stayed in the Bloom research group at Imperial, working with Steve to develop a portfolio of satiety hormone analogues for the treatment of obesity. Six of these analogues went through first in human studies, where my roles covered leading compound screening and candidate selection, toxicology, pharmacology, CMC and analytical project activities.",
            "I was one of the founders of Zihipp, where I held the role of Chief Scientific Officer, joining Metsera through the Zihipp acquisition. In Metsera I am a project leader in the injectables portfolio, and also a leader of the Metsera Innovation Centre, the research labs in London."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "MOSTOVOY",
        "first_name": "LISA",
        "avatar": "/images/avatars/lisa.mostovoy@populationhp.com.png",
        "title": "SVP, NEXT GEN COMMERCIALIZATION",
        "email": "lisa.mostovoy@populationhp.com",
        "phone": "+1 410.908.3946",
        "personal": ["Reside in Philadelphia, PA with my two wonderful daughters, husband, and a rescue dog ", "Born in Kyiv, Ukraine"],
        "interests": ["Community service: local and global ", "Reading", "Skiing", "Traveling and learning about other cultures "],
        "bio": [
            "I am thrilled for the opportunity to revolutionize the traditional commercial model to lower healthcare costs and unlock the full value of prevalent therapies for the population at large. Prior to joining Metsera (Population Health Partners), I led Payer Partnership at EQRx. My team was responsible for building meaningful, long-term, strategic partnerships with US payers and developing innovative commercial contracts. Prior to EQRx, I served in a number of leadership roles at Blue Cross Blue Shield Association (BCBSA) and was responsible for pharmacy strategy and innovation across the Blues, including the launch of InnovateRx (CivaScript). Prior to BCBSA, I managed national employer groups at CVS Health focusing on overall clinical strategy, management of complex custom formularies, utilization management, and benefit design. I completed a managed care residency with CVS Health, hold a Bachelor of Biology from Stevenson University, Doctor of Pharmacy from University of Maryland, and Master of Business Administration from University of Baltimore. Throughout my professional career, my passion has been and remains lowering the cost of and making life saving therapies accessible for all. "
        ],
        "type": "Metsera"
    },
    {
        "last_name": "PRICE-COUSINS",
        "first_name": "KEDA",
        "avatar": "/images/avatars/keda.price-cousins@metsera.com.png",
        "title": "EA/MIC OFFICE MANAGER",
        "email": "keda.price-cousins@metsera.com",
        "phone": "+44 79.5117.6827",
        "experience": "I have volunteered with several charitable organisations, sitting on fundraising committees and providing support for vulnerable elderly people. ",
        "personal": ["North Londoner ", "Parent to two children, Oscar and Matilda  ", "Owner of Gabsy, an exceptionally lazy tabby cat "],
        "interests": ["Reading ", "Photography", "Gardening ", "Design"],
        "bio": [
            "I grew up in Hertfordshire but have lived in London for nearly 30 years. After school I specialized in photography, print and film studies at art college. Following this I went on to graduate in Contemporary Media at Westminster. I started my career within the media industry in postproduction, moving to production before joining the BBC where I worked for 12 years. I began my time at the BBC in the Director General’s office assisting on the Free to Air Digital Strategy. Moving to take the post of Project Coordinator on the BBC North Project during the tendering of sites for BBC Media City. Finally, taking up a position assisting the Director of Strategy throughout the last Charter renewal. In 2017 I joined Professor Bloom at Imperial College and have enjoyed providing support to both the Imperial and Zihipp teams, including scheduling, finances, data management and clinical trial administration. "
        ],
        "type": "Metsera"
    },
    {
        "last_name": "READ",
        "first_name": "IAN",
        "avatar": "/images/avatars/ian.read@populationhp.com.png",
        "title": "PARTNER",
        "email": "ian.read@populationhp.com",
        "phone": "+1 646.541.0966",
        "experience": "Bringing",
        "interests": ["Golfing", "Traveling", "Spending time with family"],
        "bio": [
            "I have a 42-year track record as one of the foremost leaders, dealmakers, and shareholder value creators in the global biopharmaceutical industry.",
            "I began my career at Pfizer in 1978 and was named CEO in 2010 and Chairman of the Pfizer Board of Directors in 2011. During my tenure as CEO, Pfizer generated a total shareholder return of 250%, achieved 32 FDA approvals for new medicines, invested significantly in R&D, and completed several transformational transactions to help strengthen Pfizer’s pipeline. Previously, I served as Senior Vice President and Group President of Pfizer’s Worldwide Biopharmaceutical Businesses, overseeing five global business units: Primary Care, Specialty Care, Oncology, Established Products and Emerging Markets. Prior to which, I held positions in several of the company’s largest, fastest-growing operations, including Chief Financial Officer, Pfizer Mexico, and Country Manager, Pfizer Brazil.  ",
            "I currently serve as Chairman of the Board of Areteia Therapeutics and TriNetX, LLC.  I am also an Operating Executive at the Carlyle Group and a member of the Advisory Committee with Launch Therapeutics.",
            "I earned his B.S. in chemical engineering from London University Imperial College and subsequently became a Chartered Accountant of England and Wales."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "REGLINSKA",
        "first_name": "BEATA",
        "avatar": "/images/avatars/beata.reglinska@metsera.com.png",
        "title": "SENIOR DIRECTOR R&D",
        "email": "beata.reglinska@metsera.com",
        "phone": "+44 75.3301.0702",
        "experience": ["Exploring data analytics and productivity tools/apps/ software", "Exploring visual thinking, visual representation of information and data"],
        "personal": ["Born in Poland (Gdansk) and came to live in UK in 2008", "Mother to one bouncy boy Theo (though I like to call him Theotimus)"],
        "interests": ["Sketching portraits", "Learning about human psychology and watching thrillers", "Fitness "],
        "bio": [
            "My journey in science started when I was a child vigorously destroying things around me with a clear purpose of finding out how they work… I then went on to study Science in Quality Management diving into analytical science and instrumental analysis and earning a BSc from Gdynia Maritime University in Poland (1999-2005). After graduating, I moved to the UK where I started my professional career. ",
            "In 2008-2016, I worked at Kraft and Mondelez's research facility and GMP contract laboratory (RSSL), developing & validating analytical methods, managing HPLC & LCMS projects for food and pharmaceutical products. My role at RSSL covered a wide range of responsibilities from equipment maintenance, improving the lab’s quality systems, mentoring personnel, liaising with customers, collaborating with internal and external teams to drive efficiency when working on complex projects, to presenting for internal and external audits. ",
            "In 2011-2012 I studied MSc in Applied Human Nutrition (Oxford Brookes University), which ignited my interest in appetite control, and led me to the pivotal work on gut hormone analogues by Professor Stephen Bloom and his team at Imperial College London. I had the pleasure of joining the team in 2016, to support and manage in-house HPLC projects and external bioanalytical, CMC and toxicology projects for five Phase I (FIH) clinical trials. Working with the team for 8 years gave me sound training in a multifaceted drug development process, from early discovery to Phase 1 clinical trials for GLP-1 and glucagon receptor agonists.",
            "Since October 2023, I'm very excited to step into my new role at Metsera and collaborate with all teams to deliver data-driven projects that will bring solutions to obesity. So please reach out!"
        ],
        "type": "Metsera"
    },
    {
        "last_name": "RICHARDS",
        "first_name": "JOHN",
        "avatar": "/images/avatars/jdrichards1@gmail.com.png",
        "title": "CMC AND MANUFACTURING ADVISOR",
        "email": "jdrichards1@gmail.com",
        "phone": "+1 978.394.3681",
        "experience": "Global experience at building and maintaining at all levels mutually beneficial relationships with external partners. ",
        "personal": ["British in my heart, American in my head", "Married to Ruth a fellow peptide chemist from Oxford for 42 years", "Father of two sons James 36 and David 34 ", "Father-in-Law to Mollie and Kristen","Grandfather to Caitlyn 3 and Leigh 2 with a third granddaughter due in June", "My Family is the center of my beeing"],
        "interests": ["Global Travel to explore and be enriched by different cultures of our world", "Building scale replicas of c17th & 18th century sailing ships", "Seeking to understand the world we live in, to grow in wisdom, and to live and ultimately die with grace", "Walking for pleasure"],
        "bio": [
            "After growing up in Birmingham, England I read Chemistry at the University of Oxford where I gained a MA in Chemistry and a DPhil (PhD) in Peptide Chemistry. Subsequently I did a Post Doc in Max Purtz’s team at the MRC Laboratory of Molecular Biology in Cambridge where I worked with the team led by Bob Sheppard developing Fmoc solid phase peptide chemistry. Subsequently following a period as a staff scientist at the MRC Neurochemical Pharmacology Unit in Cambridge, I moved into a small startup company making peptides for research institutes. Subsequently I moved into ICI (Astra Zenica) developing scaled up cGMP peptides. In the early 1990’s my next move was both into biotech and translating to the USA, running a group from lead development to clinical manufacture of peptide-based vaccines. Subsequently I joined with Clive Meanwell in The Medicines Company when it was founded in 1997. Our first product was the registration and commercialisation of Bivalirudin a peptide-based anticoagulant, which at the time required the largest commercially produced volume of a synthetic peptide manufactured to date. During the next twenty-two years I worked on developing the CMC programs for over 15 products including everything from small molecules to large biologicals. I did take a three-year side trip to a company developing a novel HIV inhibitor but subsequently returned to MDCO. After our final rodeo developing Inclisiran for hyperlipidima and then MDCO’s acquisition followed by a short period in Novartis, I retired from full time work at the end of 2020. Subsequently as a founder of Comanche Biopharma, I have built a CMC team which I continue to mentor and lead to develop a novel combination siRNA based first therapeutic treatment for preeclampsia. For PHP I assisted the establishment and set up of CMC operations at Areteia and now work with Metsera seeking to assist developing ultra large-scale peptide manufacture to provide solutions to the global challenge of obesity "
        ],
        "type": "Metsera"
    },
    {
        "last_name": "RICHARDSON",
        "first_name": "TARA",
        "avatar": "/images/avatars/tara.richardson@populationhp.com.png",
        "title": "VP, CLINICAL OPERATIONS LEADER",
        "email": "tara.richardson@populationhp.com",
        "phone": "+1 978.394.3681",
        "personal": ["Based in NJ"],
        "interests": ["Sneakers, amature private investigator, ordained minister"],
        "bio": [
            "Prior to joining Population Health Partners in 2021, I was a Sr. Clinical Project Director at The Medicines Company where I was responsible for leading phase II and III clinical trials.",
            "I brought two drugs to market as well as completing a successful FDA inspection with no findings. ",
            "I started my pharmaceutical career in 2005 at Schering Plough in the Clinical Documentation department.  I moved on to CTA work at Altana/Nycomed and Mitsubishi Pharma until my move to The Medicines Company where I rose through the ranks from CTA to Sr. Director.",
            "I earned my baccalaureate degree in Liberal Arts and Business from Penn State University."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "STOEKENBROEK",
        "first_name": "ROBERT",
        "avatar": "/images/avatars/robert.stoekenbroek@metsera.com.png",
        "title": "VICE PRESIDENT OF INVESTMENT STRATEGY",
        "email": "robert.stoekenbroek@metsera.com",
        "phone": "+1 908.206.6357",
        "personal": ["Inclisiran has been a common thread in my life – not only was it the reason I moved from the Netherlands to the United States, but I also met my wife at an inclisiran investigator meeting (she was an investigator). We had our first child, Sophia, in November 2023. "],
        "interests": ["Flying planes (with and without engines), learning everything there is about human physiology and pathology, and feeling like I have a positive impact."],
        "bio": [
            "I joined Metsera / Population Health Partners in 2022 as a Vice President of Investment Strategy and Portfolio Operations. A physician by training, I obtained my PhD focusing on the development of novel therapies for patients with a high cardiovascular disease risk and have >10 years of experience in clinical research – both from the perspective of an investigator / clinician in academic medicine and in industry. As part of my clinical work, I've extensively traveled to remote areas of the world to diagnose and treat patients with hereditary diseases that put them at extreme risk of cardiovascular disease. I joined The Medicines Company in 2017 where I worked on the development of the cholesterol-lowering small interfering RNA inclisiran. After the acquisition of The Medicines Company by Novartis, I worked at Novartis where I led parts of the clinical development and medical affairs strategy and played a pivotal role in the integration of inclisiran into Novartis. I was ultimately involved in the commercial launch of inclisiran and transitioned to Population Health Partners shortly after."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "TAROZZI",
        "first_name": "LANI",
        "avatar": "/images/avatars/lani.tarozzi@metsera.com.png",
        "title": "DIRECTOR PROJECT MANAGEMENT COMMUNICATIONS",
        "email": "lani.tarozzi@metsera.com",
        "phone": "+1 917.597.0573",
        "personal": ["I live with my husband, Marc, and our two adult-ish boys, Mick & Evan, in the West Village of NYC, not too far from my alma mater, NYU, where I majored in Economics and minored in Fine Arts.  ", "We’ve also squeezed into our apartment two Havanese pups, Polly & Charlie.  ", "And, as a funny side note, when Mick was in 4th grade, he played the role of the duodenum in the school play, “The Human Body”!"],
        "interests": ["Gardening", "Decorating / Redecorating", "Exercising", "Listening to the podcast “Smartless”"],
        "bio": [
            "There’s almost nothing less that my family likes to hear from me than, “New system!” My excitement around discovering that our family can be more efficient at “X”, brings me great joy and the rest of the family, well, a bit less joy in the “new system” onboarding.  That energy I have around change, productivity, and implementation is what I feel organically brought me to a career in project management and I am very fortunate to be able to spread my wings and be an enthusiastic contributor at Metsera.",
            "My career started in the hotel industry working for ex-Studio 54 owner, Ian Schrager, in his NYC-boutique hotels, then transitioning to the fashion world at Coach and Ralph Lauren, to then start-up entrepreneurship.  To name a few, I was the business development manager with a food start-up producing Cauliflower Tots. I formed a bike and active lifestyle fashion accessories company called Tandem NY, where I was recognized as Woman Bike Entrepreneur by the League of American Cyclists. I even started an after-school skateboarding lesson program — running the business, not teaching! Most recently I worked as Project Manager of Web Development at the Cardiovascular Research Foundation, CRF, where I drew on my experience in web development and marketing to manage and produce a variety of digital projects. ",
            "In my free time, I am on the Board of the Modern Art Foundry Foundation, advancing fundraising and organizing the preservation and protection of the archived client materials of over 90 years. MAF is the foundry that has created bronze sculptures for acclaimed artists such as Louise Bougeois, Gaston Lachaisse, Isamu Noguchi, and hearalds the casting of the “Alice in Wonderland” sculpture in Central Park. Additional Relevant Experiences.",
            "A few career-related things that could lend themselves to the work being done at Metsera — I have some loose connections to the fitness world from my Tandem NY biking days and I have built strong relationships within CRF."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "TERRIL",
        "first_name": "LIBBY",
        "avatar": "/images/avatars/libby.terril@metsera.com.png",
        "title": "PROJECT MANAGER – CLINICAL DEVELOPMENT",
        "email": "libby.terril@metsera.com",
        "phone": "+1 816.832.0701",
        "experience": "Recruitment, Headhunting, Human Strategy/Resources, Mentoring, Executive Assistant, Scheduling",
        "personal": ["From Kansas City, Previous Cities Lived in: Fayetteville, AR and Orlando, FL"],
        "interests": ["Kansas City Chiefs, Hockey (Chicago Blackhawks, NY Rangers), Broadway/musicals, music/singing, watching movies/TV, running "],
        "bio": [
            "I have a dynamic professional blending expertise in Human Development and Family Science with a successful background in Clinical Research and Engineering recruitment. Graduating with honors, I gained a profound understanding of human development's intricate facets. This foundation seamlessly translated into a successful career where I played a pivotal role in Clinical Research and Engineering recruitment/headhunting for 2+ years.",
            "In this role, I uniquely bridged the technical requirements of engineering roles with a deep comprehension of human factors in clinical research. Known for exceptional communication, empathy, and strategic thinking, I facilitated collaborations that prioritized the human element in every endeavor. This skill set, coupled with a commitment to excellence, made me an influential figure in driving advancements in healthcare and technology.",
            "I have transitioned into project management for clinical development, bringing a wealth of experience and a holistic perspective to this dynamic role. This move reflects my dedication to making a positive impact on individuals, families, and the broader community. I continue to navigate a multidimensional career path, ensuring that the intersection of science and humanity remains at the forefront of my endeavors. In project management, I am poised to contribute significantly to the advancement of clinical development, combining technical expertise with a strong understanding of human dynamics."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "VOGT",
        "first_name": "PATRICIA",
        "avatar": "/images/avatars/pat.vogt@metsera.com.png",
        "title": "SR DIRECTOR HUMAN STRATEGY",
        "email": "pat.vogt@metsera.com",
        "phone": "+1 732.236.5073",
        "personal": ["Two teen sons and a labrador retriever", "Volunteer at Raritan Valley Headwaters", "Microsoft Teams promote"],
        "interests": ["Hiking", "Cooking", "Yoga", "Barre"],
        "bio": [
            "I am a senior HR professional with more than 25 years of experience in HR strategy, technology, implementation, and global operations.  I strive to bring an analytical mindset and creative problem-solving to the table, while fostering strong partnerships across teams. ",
            "Prior to joining the Company, I served as Director, Global HR Technology at Catalent Pharma Solutions for eight years, where I led the HR Systems Workstream for more than 10 acquisitions and 2 divestitures. I also led HRIS and Operations at The Medicines Company and Melinta Therapeutics, completing a Workday HR implementation in 12 weeks, as well as overhauling Melinta’s benefits program. My background includes implementation consulting for HR and Payroll systems across various industries."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "WALSH",
        "first_name": "JAYJ",
        "avatar": "/images/avatars/jayj.walsh@populationhp.com.png",
        "title": "DESIGNER",
        "email": "jayj.walsh@populationhp.com",
        "phone": "+1 856.685.3494",
        "experience": "I have helped to create the Metsera tools and tutorials, such as PPT templates, PPT Template Tutorial, Word Templates.",
        "personal": ["The youngest of 6 ", "Philadelphia Resident", "Very rational, easy going, and straight forward person"],
        "interests": ["Board/Video Games ", "Martial Arts", "Travel", "Comedy"],
        "bio": [
            "My journey in the world of design began at Rowan University, where I honed my craft as a member of the Rowan University Student Center Marketing Department. There, I dedicated my creative talents to producing marketing materials for various university events and celebrations.",
            "In 2018, I graduated with a Bachelor of Arts degree, with a specialized focus on Graphic Design from Rowan University. Eager to further expand my expertise, I embarked on an internship at Donovan/Green during the summer of the same year. This experience allowed me to immerse myself in the realm of Automotive design projects. Donovan/Green extended a full-time position to me following the completion of my internship. ",
            "Over the following years with Donovan/Green, I worked on bringing a variety of projects to life, such as books, company branding projects, various marketing materials across multiple industries, and website design, to name a few. ",
            "In April of 2023, I transitioned to work part time with Population Health Partners, primarily focusing on projects with Metsera. My main focus to date has been on the implementation of onboarding documentation and tools for general use by the Metsera team."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "WIJNGAARD",
        "first_name": "PETER",
        "avatar": "/images/avatars/peter.wijngaard@populationhp.com.png",
        "title": "PARTNER PHP",
        "email": "peter.wijngaard@populationhp.com",
        "phone": "+1 973.723.6726",
        "personal": ["Originally from the Netherlands now living in Livingston NJ, Married to Janet. Have 2 sons Bas (24 years old & studying industrial engineering in Switzerland) and Marc (13 years old and in Heritage Middle School in Livingston NJ"],
        "interests": ["Golf, hiking, skiing, playing board games & watching crime series"],
        "bio": [
            "I joined Population Health Partners as a partner in 2021.",
            "I have more than 25 years of experience in the pharmaceutical industry and most recently was the Chief Development Officer at The Medicines Company leading the development of inclisiran before the company was acquired by Novartis in January 2020. Prior to The Medicines Company, I worked in various roles in Product Development, Medical Affairs, and Business Development in several large and small pharmaceutical companies. I led the global Transplantation Life Cycle Group, was the Global Alliance Director for Genentech at Hoffmann-La Roche and led the European Development and Medical Affairs teams at Viropharma.",
            "I started my career as a basic scientist in the Utrecht University Medical Center and I am an author of more than 50 scientific articles on transplant immunology, immunosuppression and molecular biology. I have a PhD in Immunology from Utrecht University, the Netherlands."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "YOUNG",
        "first_name": "MARK",
        "avatar": "/images/avatars/mark.young@populationhp.com.png",
        "title": "ASSISTANT GENERAL COUNSEL (VALIDAE HEALTH)",
        "email": "mark.young@populationhp.com",
        "phone": "+1 213.663.4799",
        "experience": "Licensed attorney in California and New York. Speaks/reads Mandarin Chinese poorly.",
        "personal": ["Have a 4-year old son", "Have 2 cats"],
        "interests": ["Cooking", "Reading", "Travelling", "Basketball"],
        "bio": [
            "I joined Validae Health in September 2023, working remotely from my home in San Diego, CA.",
            "Prior to joining Validae, I was General Counsel at Anji Pharmaceuticals, where I oversaw all legal operations of the company, from managing license and CRO agreements to handling employment matters and serving as corporate secretary of the board.",
            "I spent most of my early career working for two Chinese law firms in Shanghai. In addition to advising on biotech venture capital and licensing deals, I represented clients in several international commercial arbitration disputes and advised on cross-border M&A deals involving the US, Asia and Africa.",
            "I received a B.S. degree in Biomedical Engineering from Tulane University in New Orleans, and a J.D. from New York University School of Law."
        ],
        "type": "Metsera"
    },
    {
        "last_name": "ZACCHIA",
        "first_name": "LENA",
        "avatar": "/images/avatars/lena.zacchia@populationhp.com.png",
        "title": "VP, CLINICAL OPERATIONS LEAD",
        "email": "lena.zacchia@populationhp.com",
        "phone": "+1 973.868.8457",
        "experience": "Certified Project Management: Project Management Institutue/PMLG",
        "personal": ["Based in New Jersey"],
        "interests": ["Reading, Attending concerts/sporting events"],
        "bio": [
            "I am a VP, Clinical Operations Leader at Validae Health with 25+ years experience in Clinical Operations. I began my career as a Clinical Research Associate at Organon Inc., monitoring a Phase IIIa/IV Central Nervous System study for Remeron®. I spent 12 years at Schering Plough/Merck in the Cardiovascular Department and contributed to two successful NDAs:  Zetia® and Zontivity®.  I spent several years at Novartis as a Clinical Trial Head, working in Respiratory and Global Medical Affairs – Oncology.  Prior to joining Validae Health, I was a Clinical Project Director at The Medicines Company, where I was responsible for leading multiple studies:  Phase I (US), Phase III (Global) and Phase III (CV Outcome Study).",
            "I earned a Bachelor of Science degree in Biology from Montclair State University."
        ],
        "type": "Metsera"
    }
]
